// 1)  - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = +prompt('Введіть число від 1-59');
// if (time >= 0 && time <= 14){
//     console.log('First quarter')
// } else if (time >=15 && time <=25){
//     console.log('Second quater')
// } else if( time >=26 && time <=43){
//     console.log('Third quater')
// } else if(time >=44 && time <=50){
//     console.log('Fourth quater')
// } else{
//     console.log('Ти ввів щось не те!')
// }

// 2)  - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//  let day = +prompt('Введіть своє число від 1-31');
// if (day >= 1 && day <= 12){
//     console.log('First Decade')
// } else if (day >= 13 && day <= 21){
//     console.log('Second Decade')
// } else if (day >= 22 && day <= 31){
//     console.log('Third Decade')
// } else{
//     console.log('Ти ввів щось не те')
// }

// 3) - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test;
// if (confirm('Test')) {
//     test = 'Вірно';
// } else {
//     test = 'Неправильно';
// }
// console.log(test)

// 4) - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = +prompt('enter 1, 0, -3');
// if(a !== 0){
//     console.log('Вірно')
// }else {
//     console.log('Не вірно')
// }

// 5) - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let weeks = prompt('Введіть день від 1-7')
// switch (weeks){
//     case "1":
//         document.write("Сьогодні о 20:00 у вас курси");
//         break;
//     case "2":
//         document.write("Сьогодні о 16:30 ви повинні сходили в зал");
//         break;
//     case "3":
//         document.write("О 15:00 у вас зустріч з важливим партнером по бізнесу");
//         break;
//     case "4":
//         document.write("На 18:00 у вас зустріч з вашою дівчиною");
//         break;
//     case "5":
//         document.write("Сьогодні у вас останній робочий день в цьому місяці)");
//         break;
//     case "6":
//         document.write("Сьогодні у вас вихідний день,проведіть його як ваша душа бажає");
//         break;
//     case "7":
//         document.write("Сьогодні у вашого друга день народження о 18:00 але не забудьте його привітати зранку)");
//         break;
// }

// 6) - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = +prompt('Потрібно ввести кількість днів в цьому році');
// if(year % 4 === 0){
//   document.write('Цей рік високосний');
// }else {
//     document.write('Цей рік не високосний');
// }
//
// 7) - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let js = prompt('What is official name JavaScript? ');
// if (js === 'ECMAScript') {
//     document.write('TRUE');
// } else {
//     document.write('You donnt now? ECMAScript!');
// }





