// 1) - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let a = +prompt('Введіть перше число');
// let b = +prompt('Введіть друге число');
// if (a > b){
//     console.log(a)
// } else if (a === b){
//     console.log('Це одинакові числа')
// } else {
//     console.log(b);
// }

// 2) - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let flat = +prompt('Enter the flat number ')
// if (flat >= 1 && flat <= 20){
//     document.write('First entrance')
// } else if (flat >=21 && flat <=48){
//     document.write('Second entrance')
// } else if( flat >=49 && flat <=90){
//     document.write('Third entrance')
// } else {
//     document.write('You have gone beyond your entrance')
// }

// 3) - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Enter your numeric value')
// if(number === 10){
//     document.write('Вірно')
// }else{
//     document.write('Невірно')
// }

// 4) - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = [];
// if ( typeof x === 'number'   ){
//     console.log("1")
// }else if (typeof x === 'string'){
//     console.log(2)
// } else if (typeof x === "boolean"){
//     console.log(3)
// } else if (typeof x === "object") {
//     console.log(3)
// }

// 5) - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temp = +prompt('Введіть температуру')
// if (temp >=+10 && temp <=+22){
//     console.log('Ми йдемо вчитись')
// } else{
//     console.log('Сиди дома')
// }

// 7)  - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let podarok = +prompt('Введіть число від 1-5')
// switch (podarok){
//     case 1:
//         console.log("Ви виграли автомобіль.");
//         break;
//     case 2:
//         console.log("Ви виграли мотоцикл.");
//         break;
//     case 3:
//         console.log("Ви виграли телефон.");
//         break;
//     case 4:
//         console.log("Ви виграли літак.");
//         break;
//     case 5:
//         console.log("Ви виграли білет в кіно.");
//         break;
//     default:
//         console.log("Ха-ха,ти нічого не виграв");
// }